"""

Реализуйте функцию stringify(), похожую на JSON.stringify(), но со следующими отличиями:
ключи и строковые значения должны быть без кавычек;
строчка (линия) в строке заканчивается самим значением, без запятой.
Синтаксис:

stringify(value[, replacer[, spaces_count]])

Параметры:

value: Значение, преобразуемое в строку
replacer: необязательный. Строка – отступ для ключа; Значение по умолчанию – один пробел
spacesCount: необязательный. Число – количество повторов отступа ключа. Значение по умолчанию – 1.

"""


def stringify(value, replacer=' ', spaces_count=1):
    pass
